Revit 2027 API
SunAndShadowSettings.GetMatchingPreset Method
 Finds the name of the 'per-document' SunAndShadowSettings that matches the properties of this per-view element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string GetMatchingPreset()
Public Function GetMatchingPreset As String
public:
String^ GetMatchingPreset()
member GetMatchingPreset : unit -> string
Return Value
String
 Name of the per-document SunAndShadowSettings that matches the view specific element.
Exceptions
Exception | Condition
ArgumentException |  The SunAndShadowSettings is not view-specific.
See Also
Reference
SunAndShadowSettings Class
Autodesk.Revit.DB Namespace